title: XML-RPC Abuse Detection
id: 74017758-2c07-422e-a100-55282abfdea8
status: experimental
description: Detects exploitation of dangerous XML-RPC methods for brute force amplification,
  DDoS reflection, and reconnaissance against WordPress and CMS platforms
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.initial_access
- attack.credential_access
- attack.t1110
- attack.t1190
logsource:
  category: webserver
detection:
  selection_uri:
    cs-uri|contains: xmlrpc.php
  selection_method:
    cs-method: POST
  selection_body:
    cs-uri|contains:
    - system.multicall
    - pingback.ping
    - wp.getUsersBlogs
    - system.listMethods
  condition: selection_uri and selection_method
falsepositives:
- Legitimate XML-RPC integrations with authorized remote publishing tools
level: high
