title: WebSocket Hijacking Attack Detection
id: 66ef63f8-71f7-4d53-9936-86681252388d
status: experimental
description: Detects WebSocket hijacking attempts via unauthorized WebSocket upgrade
  requests using automated tools or from untrusted sources
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.exfiltration
- attack.collection
- attack.initial_access
- attack.t1041
- attack.t1213
- attack.t1190
logsource:
  category: webserver
detection:
  selection_upgrade:
    cs-uri|contains:
    - /ws
    - /websocket
    - /socket.io
  selection_agent:
    cs(User-Agent)|contains:
    - python
    - curl
    - wget
    - wscat
    - websocat
  condition: selection_upgrade and selection_agent
falsepositives:
- Legitimate WebSocket client libraries used by authorized backend services
level: high
