title: Remote File Inclusion (RFI) Attack
id: 272fe000-4772-4b9d-8631-391f3fc56d3f
status: experimental
description: Detects attempts to include remote files via HTTP, HTTPS, or FTP protocol
  schemes in URI parameters
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.command_and_control
- attack.execution
- attack.initial_access
- attack.t1105
- attack.t1059
- attack.t1190
logsource:
  category: webserver
detection:
  selection:
    cs-uri|contains:
    - ?include=http://
    - ?include=https://
    - ?file=ftp://
    - =http%3a%2f%2f
    - =https%3a%2f%2f
    - =ftp%3a%2f%2f
    - '%68%74%74%70'
    - '%66%74%70'
  condition: selection
falsepositives:
- Legitimate federated authentication or webhook parameter passing
level: critical
