title: Dangerous File Extension Access
id: 2e0be694-7b62-40df-b14a-d3f80096d78e
status: experimental
description: Detects attempts to access or download high-risk executable file types
  via HTTP commonly used for malware delivery
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.execution
- attack.command_and_control
- attack.initial_access
- attack.t1105
- attack.t1059.004
- attack.t1059.001
- attack.t1190
logsource:
  category: webserver
detection:
  selection_method:
    cs-method: GET
  selection_uri:
    cs-uri|re: \.(exe|scr|vbs|ps1|sh|bat|msi|hta|iso)$
  condition: selection_method and selection_uri
falsepositives:
- Authorized software distribution platforms, update servers, or admin download portals
level: high
