title: Unauthorized Administrative Interface Access Attempt
id: 70886f53-acd2-44a7-a710-a7beccc27fe3
status: experimental
description: Detects unauthorized access attempts to administrative interfaces and
  privileged endpoints
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.credential_access
- attack.privilege_escalation
- attack.initial_access
- attack.t1110.001
- attack.t1078.001
- attack.t1190
logsource:
  category: webserver
detection:
  selection:
    cs-uri|contains:
    - /admin
    - /administrator
    - /wp-admin
    - /phpmyadmin
    - /cpanel
    - /console
    - /dashboard
    - /manager/html
    - /backend/
  filter_legit:
    cs-uri|contains:
    - health
    - status
  condition: selection and not filter_legit
falsepositives:
- Legitimate access from administrators via authorized IP addresses or VPN
level: critical
