title: Unicode Obfuscation Detected
id: eb4f1414-450e-4f66-b0a3-abdfa2d5fb51
status: experimental
description: Detects Unicode percent-encoded characters used to evade WAF and input
  validation filters
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.defense_evasion
- attack.t1027
logsource:
  category: webserver
detection:
  selection:
    cs-uri|re: '%u[0-9a-fA-F]{4}'
  condition: selection
falsepositives:
- Legitimate internationalized application paths using Unicode encoding
level: medium
