title: SQL Injection Attack Detected
id: 96502bce-7285-4adc-a815-080d229088fe
status: experimental
description: Detects SQL injection attempts in HTTP requests
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.credential_access
- attack.initial_access
- attack.execution
- attack.t1203
- attack.t1550
- attack.t1190
logsource:
  category: webserver
detection:
  selection:
    cs-uri|contains:
    - ''' OR ''1''=''1'
    - UNION SELECT
    - sleep(
    - benchmark(
    - xp_cmdshell
    - null,null
    - concat(select
    - '*select'
  condition: selection
falsepositives:
- Legitimate SQL query strings in development environments
level: critical
