title: Server-Side Template Injection
id: 0080fef4-8aa7-46e7-b529-2d29296a3281
status: experimental
description: Detects HTTP requests containing template engine syntax used to confirm
  or exploit SSTI vulnerabilities for arbitrary code execution
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.initial_access
- attack.t1190
logsource:
  category: webserver
detection:
  selection_markers:
    cs-uri|contains:
    - ${
    - '{{'
    - <%=
  selection_class:
    cs-uri|contains:
    - .__class__
    - get_type
  selection_math:
    cs-uri|contains|all:
    - 7*7
    - '49'
  condition: 1 of selection_*
falsepositives:
- Template engines used in legitimate application URI patterns
level: critical
