title: Log4Shell JNDI Injection Attempt
id: 9136e5f6-864c-4cc2-8bdf-5e384021d1b3
status: experimental
description: Detects Log4Shell (CVE-2021-44228) and JNDI injection attempts in HTTP
  headers and request parameters targeting vulnerable Log4j implementations
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.command_and_control
- attack.execution
- attack.initial_access
- attack.t1105
- attack.t1203
- attack.t1190
logsource:
  category: webserver
detection:
  selection:
    cs-uri|contains:
    - '${jndi:'
    - jndi:ldap
    - jndi:rmi
    - jndi:dns
    - jndi:ldaps
    - jndi:iiop
  condition: selection
falsepositives:
- Legitimate Log4j testing in authorized internal security assessments
level: high
