title: HTTP Response Splitting Attack
id: 1843fc1a-104d-4591-947a-fd184fab8594
status: experimental
description: Detects HTTP Response Splitting attacks using CRLF injection in HTTP
  headers for cache poisoning or XSS
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.execution
- attack.defense_evasion
- attack.initial_access
- attack.t1059.007
- attack.t1557.002
- attack.t1190
logsource:
  category: webserver
detection:
  selection_crlf:
    cs-uri|contains:
    - '%0d%0a'
    - '%0D%0A'
    - \r\n
    - \r
    - \n
  selection_header:
    cs-uri|contains:
    - 'Set-Cookie:'
    - 'Location:'
    - 'Content-Type:'
    - HTTP/1.
  condition: selection_crlf and selection_header
falsepositives:
- Web application testing tools performing header injection checks
level: medium
