title: OS Command Injection Attempt
id: 4cf99af3-a1ac-4733-8557-f7c46076810a
status: test
description: Identifies OS command injection patterns in HTTP URI and request body
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.execution
- attack.initial_access
- attack.t1059.003
- attack.t1059.004
- attack.t1190
logsource:
  category: webserver
detection:
  selection:
    cs-uri|re: ;.*(cat|ls|whoami|wget|curl|bash|sh)|\|.*(cat|whoami|bash)|\$\(|`|/etc/passwd|/bin/bash
  condition: selection
falsepositives:
- Shell-based development tools or admin scripts accessed over HTTP
level: critical
