title: Local File Inclusion (LFI) Attack
id: 5ce742a2-d75c-48a0-967c-b2f9efe9255b
status: experimental
description: Detects LFI attack patterns attempting to read sensitive local files
  via path traversal in HTTP requests
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.defense_evasion
- attack.discovery
- attack.initial_access
- attack.t1562.001
- attack.t1083
- attack.t1190
logsource:
  category: webserver
detection:
  selection:
    cs-uri|contains:
    - ../
    - ..%2f%2f
    - /etc/passwd
    - /etc/shadow
    - '%2fetc%2fpasswd'
    - '%2fetc%2fshadow'
    - /proc/self/
    - /var/log/
    - c:\windows\
    - '%5c..%5c'
    - ..%5c
  condition: selection
falsepositives:
- Web applications with dynamic file loading from legitimate local paths
level: high
