title: NoSQL Database Injection
id: 1fa7e012-922a-49ec-a1ae-92e22e849d5e
status: experimental
description: Identifies NoSQL injection patterns using MongoDB operator keywords in
  HTTP requests
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.discovery
- attack.credential_access
- attack.initial_access
- attack.t1046
- attack.t1550
- attack.t1190
logsource:
  category: webserver
detection:
  selection:
    cs-uri|contains:
    - '[$ne]'
    - '[$gt]'
    - '[$lt]'
    - '[$where]'
    - '[$regex]'
    - '%24ne'
    - '%24gt'
    - '%24where'
    - '%24lt'
    - '%24regex'
  condition: selection
falsepositives:
- Legitimate MongoDB query parameters used in API endpoints
level: high
