title: LDAP Injection Detected
id: 9ad7c6d8-7ba7-49f1-8b77-a1503d55f4f9
status: experimental
description: Detects LDAP injection attacks targeting directory services through malicious
  filter manipulation in HTTP requests
references: []
author: Ahmed Elnoury
date: 2025/01/01
tags:
- attack.execution
- attack.credential_access
- attack.initial_access
- attack.t1210
- attack.t1550
- attack.t1190
logsource:
  category: webserver
detection:
  selection:
    cs-uri|contains:
    - '*)(uid=*'
    - '*)(cn=*'
    - '*)(&'
    - '*)(%7c'
    - '%2a%29%28'
    - '%29%28%26'
    - )(objectClass=
    - ldap://
    - ldaps://
  condition: selection
falsepositives:
- Legitimate LDAP application queries in development environments
level: high
